{"config": {"output_layers": [["dense_6", 0, 0], ["dense_7", 0, 0], ["dense_8", 0, 0], ["dense_9", 0, 0], ["dense_10", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 28, 140, 1], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"W_constraint": null, "b_constraint": null, "nb_filter": 16, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "border_mode": "same", "activity_regularizer": null, "trainable": true, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_1", "nb_col": 3, "activation": "relu"}, "class_name": "Convolution2D", "name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "same"}, "class_name": "MaxPooling2D", "name": "maxpooling2d_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"config": {"W_constraint": null, "b_constraint": null, "nb_filter": 16, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "border_mode": "same", "activity_regularizer": null, "trainable": true, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_2", "nb_col": 3, "activation": "relu"}, "class_name": "Convolution2D", "name": "convolution2d_2", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "same"}, "class_name": "MaxPooling2D", "name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"config": {"W_constraint": null, "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "border_mode": "same", "activity_regularizer": null, "trainable": true, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_3", "nb_col": 3, "activation": "relu"}, "class_name": "Convolution2D", "name": "convolution2d_3", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "same"}, "class_name": "MaxPooling2D", "name": "maxpooling2d_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"config": {"W_constraint": null, "b_constraint": null, "nb_filter": 128, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "border_mode": "same", "activity_regularizer": null, "trainable": true, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_4", "nb_col": 3, "activation": "relu"}, "class_name": "Convolution2D", "name": "convolution2d_4", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4", "trainable": true, "border_mode": "same"}, "class_name": "MaxPooling2D", "name": "maxpooling2d_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"config": {"W_constraint": null, "b_constraint": null, "nb_filter": 256, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "border_mode": "same", "activity_regularizer": null, "trainable": true, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_5", "nb_col": 3, "activation": "relu"}, "class_name": "Convolution2D", "name": "convolution2d_5", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_5", "trainable": true, "border_mode": "same"}, "class_name": "MaxPooling2D", "name": "maxpooling2d_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["maxpooling2d_5", 0, 0]]]}, {"config": {"p": 0.25, "name": "dropout_1", "trainable": true}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"config": {"activity_regularizer": null, "b_constraint": null, "input_dim": 1280, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "bias": true, "activation": "relu", "name": "dense_1", "b_regularizer": null, "output_dim": 32}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"config": {"activity_regularizer": null, "b_constraint": null, "input_dim": 1280, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "bias": true, "activation": "relu", "name": "dense_2", "b_regularizer": null, "output_dim": 32}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"config": {"activity_regularizer": null, "b_constraint": null, "input_dim": 1280, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "bias": true, "activation": "relu", "name": "dense_3", "b_regularizer": null, "output_dim": 32}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"config": {"activity_regularizer": null, "b_constraint": null, "input_dim": 1280, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "bias": true, "activation": "relu", "name": "dense_4", "b_regularizer": null, "output_dim": 32}, "class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"config": {"activity_regularizer": null, "b_constraint": null, "input_dim": 1280, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "bias": true, "activation": "relu", "name": "dense_5", "b_regularizer": null, "output_dim": 32}, "class_name": "Dense", "name": "dense_5", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"config": {"activity_regularizer": null, "b_constraint": null, "input_dim": 32, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "bias": true, "activation": "softmax", "name": "dense_6", "b_regularizer": null, "output_dim": 11}, "class_name": "Dense", "name": "dense_6", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"config": {"activity_regularizer": null, "b_constraint": null, "input_dim": 32, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "bias": true, "activation": "softmax", "name": "dense_7", "b_regularizer": null, "output_dim": 11}, "class_name": "Dense", "name": "dense_7", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"config": {"activity_regularizer": null, "b_constraint": null, "input_dim": 32, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "bias": true, "activation": "softmax", "name": "dense_8", "b_regularizer": null, "output_dim": 11}, "class_name": "Dense", "name": "dense_8", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"config": {"activity_regularizer": null, "b_constraint": null, "input_dim": 32, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "bias": true, "activation": "softmax", "name": "dense_9", "b_regularizer": null, "output_dim": 11}, "class_name": "Dense", "name": "dense_9", "inbound_nodes": [[["dense_4", 0, 0]]]}, {"config": {"activity_regularizer": null, "b_constraint": null, "input_dim": 32, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "bias": true, "activation": "softmax", "name": "dense_10", "b_regularizer": null, "output_dim": 11}, "class_name": "Dense", "name": "dense_10", "inbound_nodes": [[["dense_5", 0, 0]]]}]}, "class_name": "Model", "keras_version": "1.2.2"}